#+title: Exercises
#+author: faultypointer
#+date: <2025-03-29 Sat>

* Write a function to exponentiate
or raise a number to an integer power. For example: ~(power 3 2)~ = \(3^2\) = 9.

idk if im supposed to loop up things like ~loop~.

well recursion to the rescue

#+begin_src lisp
(defun power (base exponent)
  (if (= exponent 0) 1
      (if (= exponent 1) base
          (power (* base base) (- exponent 1)))))

(power 3 2)
#+end_src

#+RESULTS:
: 9

It obviously doesn't work for negative numbers.

* Write a function that counts the number of atoms
in an expression. For example: ~(count-atoms '(a (b) c))~ = 3. Notice that there is something of an ambiguity in this: should ~(a nil c)~ count as three atoms, or as two, because it is equivalent to ~(a () c)~?

so how do i go about this.
I'm asuming its not as simple of as the length of list being passed. if the passed thing was ~'(a (b c (d e) f) g)~ it would print 7 i guess. so how to do. lets ignore the nil stuff for now.
so i can see if its an atom using ~atom~.
#+begin_src lisp
(atom 1)
#+end_src

#+RESULTS:
: T

so again recursion?
#+begin_src lisp
(defun count-atoms (exp)
  (if (atom exp)
      (if exp 1 0)
      (+ (count-atoms (first exp)) (count-atoms (rest exp)))))
(count-atoms '(1 2(3 4 (5 nil  6) ()  7) 8))
#+end_src

#+RESULTS:
: 8

im not counting the nil as an atom

* Write a function that counts
the number of times an expression occurs anywhere within another expression. Example: ~(count-anywhere 'a '(a ((a) b) a))~ => 3.

hmmmmmmmmmm
#+begin_src lisp
(eql 'a 'a)
#+end_src

#+RESULTS:
: T

okay.

#+begin_src lisp
(defun count-anywhere (exp ano-exp)
  (if (atom ano-exp)
      (if (eql exp ano-exp) 1 0)
      (+ (count-anywhere exp (first ano-exp)) (count-anywhere exp (rest ano-exp)))))
(count-anywhere 'a '(a ((a) b) a))
#+end_src

#+RESULTS:
: 3

* Write a function to compute the dot product
of two sequences of numbers, represented as lists. The dot product is computed by multiplying corresponding elements and then adding up the resulting products. Example:
~(dot-product '(10 20) '(3 4))~ = 10 x 3 + 20 x 4 = 110

apply? right no it was not
apply is for applying a function to just a bunch of elements in a list
the thing i was looking for was mapcar
#+begin_src lisp
(mapcar #'* '(10 20) '(3 4))
#+end_src

#+RESULTS:
| 30 | 80 |

and now i use apply

#+begin_src lisp
(defun dot-product (vec1 vec2)
  (apply #'+ (mapcar #'* vec1 vec2)))

(dot-product '(10 20) '(3 4))
#+end_src

#+RESULTS:
: 110

